app/views/events/index.html.erb

		<h3 class="col-md-8 col-md-offset-2 col-xs-12">События:</h3>
		<% Event.find_each do |event| %>
---
SELECT  "events".* FROM "events" ORDER BY "events"."id" ASC LIMIT ?  [["LIMIT", 1000]]