app/controllers/events_controller.rb

INSERT INTO "events" ("name", "location", "date", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Fireshow"], ["location", "Sochi"], ["date", "2017-09-18"], ["created_at", "2017-09-04 12:32:24.308163"], ["updated_at", "2017-09-04 12:32:24.308163"], ["creator_id", 6]]
---
  def create
  	@event = Event.new(event_params)
  	@event.creator_id = current_user.id
  	if @event.save

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Foo Bar"], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def invite
    invited_user = User.find_by_name(params[:name])
    @event = Event.find(params[:id])